<template>
    <section>
        <h1>Места и достопримечательности</h1>
        <v-tabs
            :right="!isMobile"
        >
            <v-tab>Список</v-tab>
            <v-tab>На карте</v-tab>
            <v-tab-item>
                <v-card
                    flat
                    outlined
                    rounded
                    class="mt-8"
                >
                    <DesctopZones
                        v-if="!isMobile"
                        :items="items"
                    />
                    <MobileZones
                        :items="items"
                        v-else
                    />
                </v-card>
            </v-tab-item>
            <v-tab-item>
                <ymap
                    class="pt-4"
                    :items="items"
                />
            </v-tab-item>
        </v-tabs>
    </section>
</template>

<script>
import DesctopZones from './DesctopZones.vue';
import MobileZones from './MobileZones.vue';
import Ymap from './Ymap.vue';

export default {
  components: { DesctopZones, MobileZones, Ymap },
  name: 'ZonesMapper',
  data: () => ({
    items: [
      {
        name: 'Головина башня',
        text: `Головина башня  - самый мощный бастион крепости.
        Ее стены имеет толщину около 6 метров. Башню назвали по имени ее строителя.
        Она служила для обороны подступов со стороны устья Невы.
        Здесь размещался сторожевой пост.
        Проезд перекрывал тяжелые ворота с опускающимися коваными решетками.
        Перед выездом был вырыт ров. Через него был устроен перекидной мост.
        На башне, по указу Петра I, прикрепили ключ от города.
        Он стал символом начала победы над шведами в северной войне.`,
        coords: [59.952985, 31.035674],
      },
      {
        name: 'Королевская башня (Нарышкина башня)',
        text: `Королевская башня (Нарышкина башня) 
        - Она расположена в северо-восточном углу крепости. 
        Все бойницы вежи – раструбы, направлены на Ладогу. 
        Они предназначены для обстрела вражеского десанта. 
        Все башни имеют по 5 ярусов`,
        coords: [59.954946, 31.039679],
      },
      {
        name: 'Флажная башня ',
        text: `Флажная башня – Она расположена в юго-восточном углу крепости. 
        Ее бойницы направлены в сторону Шлиссельбурга. 
        Свое название она получила из-за того, что тут находился поднятый флаг крепости. 
        Башня сильно пострадала во время Великой Отечественной войны `,
        coords: [59.953689, 31.040468],
      },
      {
        name: 'Государева башня',
        text: `Государева башня – Она южная часть оборонительного сооружения.
        Башня названа по имени Г. Головкина – соратника Петра I, 
        бившегося со шведами в начале XVIII столетия.`,
        coords: [59.953781, 31.036310],
      },
      {
        name: 'Светличная башня',
        text: `Светличная башня – Возвели сооружения, как часть оборонительной цитадели. 
        В ней было 3 вежи: Колокольня, где размещался вестовой колокол, 
        Мельничья, где в начале XVIII века находилась ветряная мельница. 
        Светличная башня названа так потому, что в ней было жилое помещение – светлица. 
        Ее построили в XVI веке. `,
        coords: [59.954644, 31.038939],
      },
      {
        name: 'Меншикова башня',
        text: `Меншикова башня – Построена в XV – XVI века. 
        Названа в честь князя Меншикова. Разобрана в 1816-1818 годах.`,
        coords: [59.954506, 31.038003],
      },
      {
        name: 'Старая Тюрьма',
        text: `К концу XIX века крепость Орешек имела политическую тюрьму 
        здесь находился Секретный дом с 10 одиночными камерами, в которых отбывали сроки революционеры. 
        Здесь не бывало не одного старика – лишь молодые люди девушки, 
        юные революционеры да претенденты на императорскую власть`,
        coords: [59.954671, 31.039447],
      },
      {
        name: 'Новая тюрьма',
        text: `Затем в 1883 году  построили двухэтажную Новую тюрьму, 
        куда должны были привезти на пожизненный срок членов группы “Народная Воля”, 
        где для них была уготована жестокая учесть: 40 одиночных камер с режимом карцера, 
        на 2-ом этаже были проложены узкие проходы вдоль камер, а остальное пространство 
        пола было затянуто железной сеткой, чтобы узники не могли выброситься со 2-ого этажа. 
        Такая конструкция позволяла тюремщикам просматривать сразу все камеры обоих этажей 
        из любой точки коридора.  В стенах Новой тюрьмы люди медленно сходили с ума 
        или умирали от смертельных болезней без права на помощь, условия содержания в 
        тюрьме были жестокие: полная изоляция от мира – никакого общения не с кем, 
        кроме молчаливых надзирателей. 
        За попытки общения полагался карцер. За оскорбление надзирателя, 
        полагалась смертная казнь `,
        coords: [59.954009, 31.039828],
      },
      {
        name: 'Мемориальный комплекс',
        text: `Он посвящен обороне крепости в 1941-1943 годах. 
        Во время захвата немцами города Шлиссельбург, крепость 
        использовалась, как военный склад Балтийского флота. 
        Орешек оказался  под перекрестным огнем на линии фронта. 
        Они ежедневно обстреливали крепость из всех калибров орудий, 
        подвергали авианалетам. Крепость 
        Орешек сыграла важную роль при блокаде Ленинграда `,
        coords: [59.953804, 31.038306],
      },
      {
        name: 'Мемориал “Клятва”',
        text: `После отступления немцев крепость была полностью разрушена, 
        ни одно здание не осталось целым. До сих пор восстановлена только 
        малая часть стен и зданий. 9 мая в 1985 году здесь был построен 
        мемориальный комплекс “Клятва”, посвященный героическим защитникам крепости. 
        Часть комплекса разместилась в руинах Иоанновского собора, построенного в 1882 
        году и разрушенного в годы Великой Отечественной войны. На колоколе весел красный флаг,
        который с риском для жизни поднимали бойцы, когда его сбивали немцы. В алтарной части 
        установлена скульптурная композиция из металла – пехотинца, матроса и их командира. 
        В их поднятых руках автоматы, как символ борьбы с врагами. В оконных проемах храма 
        размещены композиции “Оружие Победы”, созданные из настоящего оружия и осколков 
        снарядов, найденных на территории крепости.
        Клятва защитников крепости, 
        которая выбита на мемориальной плите. 
        Рядом с храмом братская могила погибших 
        защитников крепости и гигантский бронзовый шар. 
        `,
        coords: [59.953881, 31.038404],
      },
      {
        name: '4-ый Тюремный корпус крепости Орешек',
        text: `Строился в 1909-1911 год, был самым большим тюремным зданием 
        в камерах можно было содержать около 500 узников, а так же размещались 
        тюремная администрация, канцелярия, столярные мастерские, кочегарка, 
        21 общая камера и 27 одиночных. В 1917 году во время революции началось ее разрушение, 
        а во время Великой Отечественной войны здание 4-ого корпуса
        было практически полностью уничтожено.`,
        coords: [59.953370, 31.036815],
      },
    ],
  }),
  computed: {
    isMobile() {
      return this.$vuetify.breakpoint.xs;
    },
  },
};
</script>
<style>
.v-expansion-panel-header > *:not(.v-expansion-panel-header__icon) {
    flex: unset !important
}
.fullwidth {
    min-width: 100% !important
}
</style>
